CSI API ETABS v1

# cSapModelGetModelIsLocked Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    bool GetModelIsLocked()

    Function GetModelIsLocked As Boolean

    Dim instance As cSapModel
    Dim returnValue As Boolean

    returnValue = instance.GetModelIsLocked()

    bool GetModelIsLocked()

    abstract GetModelIsLocked : unit -> bool

#### Return Value

Type: Boolean

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com